<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<link rel="stylesheet" href="/killerQueen/css/help.css">
<h1 id="logo"><a href="index.html"><img src="/simpleBC/img/logo.png" alt="名刺管理アプリ"></a></h1>
<nav id="menubar">

<title>ヘルプ</title>
</head>
<body>

<p>ヘルプ</p>

<p>目次</p>

１．マイリストページの使い方
ア）宣言とステップの追加方法
ⅰ． を押すと宣言を登録、編集できる画面が表示されます。
ⅱ．大きい目標である宣言とそれを達成するための小さい目標であるステップを追加することができます。
ⅲ． を押すとさらにステップを追加することができます。
ⅳ． でその宣言のタイムラインへの公開、非公開を選択できます。
ⅴ．▼カテゴリを選ぶ　で宣言をカテゴライズすることができます。
ⅵ．完了ボタンを押すと入力した宣言がマイリストに追加されます。

イ）既存宣言、ステップの編集方法
ⅰ． を押すと宣言、ステップの編集画面が表示されます。
ⅱ． を押すと表示されているステップが削除されます。

ウ）宣言の達成、削除について
ⅰ．宣言をクリックすると宣言とそのステップの一覧が表示されます。
ⅱ．削除を押すと宣言とステップがマイリストから削除されます。
※マイページの軌跡からも完全に削除されます。
ⅲ．達成を押すと宣言とステップがマイリストから消え、マイページの軌跡に が表示されます。


２．タイムライン・ブックマークについて
ア）タイムラインの使用方法
ⅰ．画面上部のバーのタイムラインをクリックすると他のユーザーの宣言の一覧が表示されます。
ⅱ．スクロールで色んなユーザー の宣言を閲覧することが可能です。
　　※タイムラインは自動更新されます。
ⅲ．いいなと感じた宣言に対して♡を押すことでリアクションをすることが出来ます。
iv.　自分も参考にしたいと感じた宣言に対して🏷（ラベル）のボタンを押すことでブックマークに保存することが出来ます。
v. 🏷（ラベル）マークをクリックするとラベルが白から黒に変わる。


イ）ブックマークの使用方法
ⅰ．画面上部のバーのブックマークをクリックするとタイムラインで保存した宣言の一覧（ブックマーク一覧）が表示されます。
ⅱ．ブックマークを消したい場合は、ブックマーク一覧の宣言にある🏷（ラベル）マークをクリックして削除する。

　３．ランクの説明
　ア）ランクの使い方
ⅰ．宣言リストの達成個数に応じてランクが付くようになっています。
ⅱ．ランクの分け方は以下の通りです。
ランクの名称：ビギナー / ブロンズ / シルバー / ゴールド
　　　アップの条件：～10 / 11～50 / 51～99 / 100～ (宣言リストの達成個数)




*/


</body>
</html>